// директиви препроцесора - інструкції з поєднання різних файлів
// до одного при підготовці їх до компіляції.
// Вони починаються з "#" і не входять до коду безпосередньо, а відповідають
// за їх заміну на певні кодові інструкції, наприклад, #include<file>
// замінюється на тіло цього файлу.
// Проблема виникає тоді, коли різні файли підключають один і той самий файл.
// Формально він дублюється і створює помилки повторного оголошення 
// змінних, функцій, структур тощо. У той же час, якщо прямого підключення
// немає, то використовувати код з файлу неможливо.
// В такому разі утворюють умовну прекомпіляцію - перший раз файл підключається,
// наступні рази - ігнорується
#ifndef PRODUCT_H
#define PRODUCT_H

#include <string>
#include <fstream>

using namespace std;
// Традиційно, у заголовкових файлах оголошуються типи 
// без реалізації - тільки "інтерфейс" - сигнатури методів.
// При цьому створюється один або декілька .срр файлів, у яких
// ці методи реалізуються (імплементуються). Такий підхід
// має назву "розділення інтерфейсу та реалізації"
struct Product {
	string name = "";
	float price = 0.0f;
	int stock = 0;
	int discount_percent = 0;

	bool load_from_file(ifstream& file);

	void save_to_file(ofstream& file) const;

	string to_string();
};

#endif  // PRODUCT_H
