#include <iostream>
#include <fstream>
#include <conio.h>
#include <string>
#include "product.h"
#include "price.h"

using namespace std;

int main()
{
	setlocale(LC_ALL, "UA");
	Price* price = new Price();
	while (true) {
		int choice;
		cout << "Choice an action:\n"
			<< "1: Init price\n"
			<< "2: Load price\n"
			<< "3: Show price\n"
			<< "4: Show from cheap to expensive\n"
			<< "5: Show from expensive to cheap\n"
			<< "0: Exit\n";

		choice = _getch();
		switch (choice) {
		case 49:  // '1'
			if (price->init()) {
				cout << "Price init success" << endl;
			}
			else {
				cout << "Price init error" << endl;
			}
			break;
		case 50:  // '2'
			if (price->load()) {
				cout << "Price load success" << endl;
			}
			else {
				cout << "Price load error" << endl;
			}
			break;
		case 51:  // '3'
			price->show();
			break;
		case 52:  // '4'
			price->show_by_price_ascending();
			break;
		case 53:  // '5'
			price->show_by_price_descending();
			break;
		case 48:  // '0'
			return 0;
		default:
			cout << "Invalid choice" << endl;
		}
	}
	delete price;
	return 0;
}
/* git - VCS (Version Control System)
система, що дозволяє "зберігати" версії коду з
можливістю повернення до попередніх версій, а також
утворення відгалужень (гілок) з різним розвитком проєкту.
Суть - збереження "різниці" - відмінностей між попереднім
і поточним станом проєкту - коміти (commits).
Це також спрощує сумісну роботу з проєктом різними учасниками.

Github - hub (місце для розміщення) репозиторіїв проєктів.
Репозиторій - частина проєкту, до якої входить код,
напрацьований розробниками, і не входять загальні ресурси,
які можна довантажити окремо (загальні бібліотеки тощо),
а також результати компіляції та збірки (проміжні та виконавчі
файли).
Відмінність задається спец.файлом ".gitignore"

Для того щоб створити та опублікувати репозиторій необхідно
- ініціалізувати репозиторій
- створити перший коміт
- опублікувати репозиторій (GitHub, Azure DevOps,
   BitBucket, GitLab тощо)
= Visual Studio дозволяє поєднати всі ці кроки в меню
	Git->Create Git Repository
	але за наявного облікового запису

-------------Система контролю версій. Продовження------------
[ПК]      -- git init --    [git]    -- git push -- [GitHub]
Project (P58)                                        https://github....
  source     |              source    | git
  headers	 | git add .    headers	  | commit        push
  resources	 |              resources | -m "message" -->
  references x
  x64		 x

Відмінність проєкту та репозиторію - репозиторій є частиною проєкту,
до якої входить лише те, що неможна взяти з загальних джерел або
створити компіляцією чи виконанням проєкту.
Ця відмінність задається у файлі ".gitignore"
Репозиторій НЕ заповнюється автоматично, слід зазначити які файли
слід до нього долучити (подати команду git add)
Commit - "збереження" поточного стану файлів репозиторію, яке
дає можливість пізніше повернутись до цього стану.
(git commit -m "message" або через інтерфейс VS)
Коміт створюється локально (у прихованій директорії .git)
на GitHub його ще не існує. Для передачі даних до GitHub
необхідно "виштовхнути" коміт (push)

------------ зворотні дії - клонування/витягування ----
Якщо на ПК немає проєкту, то здійснюємо клонування:
 - запускаємо студію, авторизуємось через GitHub
 - вибираємо "clone a repository"
 - натискаємо "GitHub" і знаходимо репозиторій
	або вставляємо посилання на репозиторій, скопійоване з браузера
 - після завершення клонування переходимо до проєктного
	вигляду дбл-клік на файл з розширенням .slnx (.sln для старих VS)

Якщо проєкт є, але в старій версії, то
 - відкриваємо проєкт (старий) у VS
 - відкриваємо View -> Git changes
 - знаходимо кнопку Pull (стрілка вниз)
 - натискаємо

----------- СКВ продовження. Конфлікти. ---------------
Конфлікти виникають, коли різні "гілки" (зміни з різних джерел)
намагаються внести дані, що суперечать один іншому. Наприклад,
було внесено зміни в один і той самий файл.
Злиття (Merge) - процес узгодження конфліктів, прийняття
підсумкової версії. У VS для цього є інструмент "Merge Editor".
Якщо гілки вносять зміни в різні файли, то злиття здійснюється
без конфліктів, проте, прямий PUSH не виконується, необхідно
прийняти "PULL then PUSH".
Практична порада: розподіляти сумісну роботу таким чином, щоб
не було необхідності різним виконавцям змінювати однакові файли.
*/